In [2]:
import pandas as pd


# series

names = ['tom','jerry','max']
marks=[90,80,100]

In [4]:
ser1 = pd.Series(data=marks,index=names)

In [5]:
ser1

tom       90
jerry     80
max      100
dtype: int64

In [6]:
type(ser1)

pandas.core.series.Series

In [7]:
ser1.shape

(3,)

In [8]:
ser1.ndim

1

In [9]:
ser2=pd.Series(data=[70,50,30],index=['ras','tan','sam'])

In [10]:
ser2

ras    70
tan    50
sam    30
dtype: int64

In [12]:
ser2[1]

50

In [14]:
ser2['sam']=90

In [15]:
ser2['sam']

90

### DataFrame

In [68]:
dict1 = {'names':['a','b','c'],'age':[30,40,30],'location':['bng','ckm','mys']}

In [69]:
df = pd.DataFrame(data=dict1,index=[1,2,3])

In [70]:
df

  names  age location
1     a   30      bng
2     b   40      ckm
3     c   30      mys

In [71]:
dict2 = {'age':[1,2,3],'place':['tr','pr','cr']}

In [72]:
df1 = pd.DataFrame(data=dict2,index=[])

ValueError: Length of values (3) does not match length of index (0)

In [73]:
df1

   age place
0    1    tr
1    2    pr
2    3    cr

In [74]:
df1.size

6

In [75]:
df1.ndim

2

In [76]:
df1.shape

(3, 2)

In [77]:
df1.loc[0:3,['age','place']]

   age place
0    1    tr
1    2    pr
2    3    cr

In [78]:
df1.iloc[0:4,0:3]

   age place
0    1    tr
1    2    pr
2    3    cr

In [79]:
df['names'].values

array(['a', 'b', 'c'], dtype=object)

In [80]:
df['age'].value_counts()

30    2
40    1
Name: age, dtype: int64

In [84]:
df[df['age'].values==30]

  names  age location
1     a   30      bng
3     c   30      mys

In [86]:
df[df['age'].values>20]

  names  age location
1     a   30      bng
2     b   40      ckm
3     c   30      mys

In [88]:
df[['age','location']]

   age location
1   30      bng
2   40      ckm
3   30      mys

In [144]:
cars = pd.read_csv(r'C:\Users\admin\Downloads\CARS_1.csv')

In [145]:
cars.head(10)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Unnamed: 15
0,Acura,NSX coupe 2dr manual S,Sports,Asia,Rear,"$89,765","$79,978",3.2,6.0,290.0,17.0,24.0,3153.0,100.0,174.0,NaN
1,Acura,3.5 RL w/Navigation 4dr,Sedan,Asia,Front,"$46,100","$41,100",3.5,6.0,225.0,18.0,24.0,3893.0,115.0,197.0,NaN
2,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225.0,18.0,24.0,3880.0,115.0,197.0,NaN
3,Acura,MDX,NaN,Asia,All,"$36,945",NaN,3.5,6.0,265.0,17.0,23.0,4451.0,106.0,189.0,NaN
4,Acura,TL 4dr,NaN,Asia,Front,"$33,195",NaN,3.2,6.0,270.0,20.0,28.0,3575.0,108.0,186.0,NaN
5,Acura,TSX 4dr,NaN,Asia,Front,"$26,990",NaN,2.4,4.0,NaN,22.0,29.0,3230.0,105.0,183.0,NaN
6,Acura,RSX Type S 2dr,NaN,Asia,Front,"$23,820",NaN,2.0,4.0,NaN,24.0,31.0,2778.0,101.0,172.0,NaN
7,Audi,RS 6 4dr,NaN,Europe,Front,"$84,600",NaN,4.2,8.0,NaN,15.0,22.0,4024.0,109.0,191.0,NaN
8,Audi,A8 L Quattro 4dr,NaN,Europe,All,"$69,190",NaN,4.2,8.0,NaN,17.0,24.0,4399.0,121.0,204.0,NaN
9,Audi,A6 4.2 Quattro 4dr,NaN,Europe,All,"$49,690",NaN,4.2,8.0,NaN,17.0,24.0,4024.0,109.0,193.0,NaN

In [97]:
cars.tail()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Unnamed: 15
438,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
439,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
440,NaN,group by,1) data will split,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
441,NaN,NaN,2) apply the function mean(mpg),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
442,NaN,NaN,3) combine,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [98]:
cars.shape

(443, 16)

In [99]:
cars.size

7088

In [100]:
cars.ndim

2

In [101]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443 entries, 0 to 442
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name_of_car  428 non-null    object
 1   Model        429 non-null    object
 2   Type         409 non-null    object
 3   Origin       428 non-null    object
 4   DriveTrain   428 non-null    object
 5   MSRP         428 non-null    object
 6   Invoice      406 non-null    object
 7   EngineSize   428 non-null    float64
 8   Cylinders    426 non-null    float64
 9   Horsepower   343 non-null    float64
 10  MPG_City     428 non-null    float64
 11  MPG_Highway  428 non-null    float64
 12  Weight       428 non-null    float64
 13  Wheelbase    428 non-null    float64
 14  Length       428 non-null    float64
 15  Unnamed: 15  2 non-null      float64
dtypes: float64(9), object(7)
memory usage: 55.5+ KB

In [102]:
cars.isnull().sum()

name_of_car     15
Model           14
Type            34
Origin          15
DriveTrain      15
MSRP            15
Invoice         37
EngineSize      15
Cylinders       17
Horsepower     100
MPG_City        15
MPG_Highway     15
Weight          15
Wheelbase       15
Length          15
Unnamed: 15    441
dtype: int64

In [104]:
cars.describe(include='all')

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Unnamed: 15
count,428,429,409,428,428,428,406,428.000000,426.000000,343.000000,428.000000,428.000000,428.000000,428.000000,428.000000,2.000000e+00
unique,38,426,9,3,3,410,403,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,Toyota,C320 4dr,Sedan,Asia,Front,"$21,595","$14,207",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,28,2,247,158,226,2,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.196729,5.807512,210.915452,20.060748,26.843458,3577.953271,108.154206,186.362150,2.935740e+06
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.108595,1.558443,72.530948,5.238218,5.741201,758.983215,8.311813,14.357991,4.149231e+06
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.300000,3.000000,73.000000,10.000000,12.000000,1850.000000,89.000000,143.000000,1.790000e+03
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.375000,4.000000,158.500000,17.000000,24.000000,3104.000000,103.000000,178.000000,1.468765e+06
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.000000,6.000000,208.000000,19.000000,26.000000,3474.500000,107.000000,187.000000,2.935740e+06
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.900000,6.000000,245.000000,21.250000,29.000000,3977.750000,112.000000,194.000000,4.402714e+06
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.300000,12.000000,500.000000,60.000000,66.000000,7190.000000,144.000000,238.000000,5.869689e+06

In [105]:
cars['name_of_car'].value_counts()

Toyota           28
Chevrolet        27
Mercedes-Benz    26
Ford             23
BMW              20
Audi             19
Honda            17
Nissan           17
Volkswagen       15
Chrysler         15
Dodge            13
Mitsubishi       13
Volvo            12
Jaguar           12
Hyundai          12
Subaru           11
Pontiac          11
Mazda            11
Lexus            11
Kia              11
Buick             9
Mercury           9
Lincoln           9
Saturn            8
Cadillac          8
Suzuki            8
Infiniti          8
GMC               8
Acura             7
Porsche           7
Saab              7
Land Rover        3
Oldsmobile        3
Jeep              3
Scion             2
Isuzu             2
MINI              2
Hummer            1
Name: name_of_car, dtype: int64

In [106]:
cars['name_of_car'].value_counts().unique()

array([28, 27, 26, 23, 20, 19, 17, 15, 13, 12, 11,  9,  8,  7,  3,  2,  1],
      dtype=int64)

In [107]:
cars['name_of_car'].unique()

array(['Acura', 'Audi', 'BMW', 'Buick', 'Cadillac', 'Chevrolet',
       'Chrysler', 'Dodge', 'Ford', 'GMC', 'Honda', 'Hummer', 'Hyundai',
       'Infiniti', 'Isuzu', 'Jaguar', 'Jeep', 'Kia', 'Land Rover',
       'Lexus', 'Lincoln', 'Mazda', 'Mercedes-Benz', 'Mercury', 'MINI',
       'Mitsubishi', 'Nissan', 'Oldsmobile', 'Pontiac', 'Porsche', 'Saab',
       'Saturn', 'Scion', 'Subaru', 'Suzuki', 'Toyota', 'Volkswagen',
       'Volvo', nan], dtype=object)

In [109]:
cars.sort_values('Weight')

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Unnamed: 15
159,Honda,Insight 2dr (gas/electric),Hybrid,Asia,Front,"$19,110","$17,911",2.0,3.0,73.0,60.0,66.0,1850.0,95.0,155.0,NaN
400,Toyota,Echo 2dr manual,Sedan,Asia,Front,"$10,760","$10,144",1.5,4.0,108.0,35.0,43.0,2035.0,93.0,163.0,NaN
399,Toyota,Echo 4dr,Sedan,Asia,Front,"$11,290","$10,642",1.5,4.0,108.0,35.0,43.0,2055.0,93.0,163.0,NaN
398,Toyota,Echo 2dr auto,Sedan,Asia,Front,"$11,560","$10,896",1.5,4.0,108.0,33.0,39.0,2085.0,93.0,163.0,NaN
383,Toyota,MR2 Spyder convertible 2dr,Sports,Asia,Rear,"$25,130","$22,787",1.8,4.0,138.0,26.0,32.0,2195.0,97.0,153.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
439,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
440,NaN,group by,1) data will split,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
441,NaN,NaN,2) apply the function mean(mpg),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
442,NaN,NaN,3) combine,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [110]:
cars.sort_values('Weight',ascending=False)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Unnamed: 15
118,Ford,Excursion 6.8 XLT,SUV,USA,All,"$41,475","$36,494",6.8,10.0,310.0,10.0,13.0,7190.0,137.0,227.0,NaN
166,Hummer,H2,SUV,USA,All,"$49,995","$45,815",6.0,8.0,316.0,10.0,12.0,6400.0,123.0,190.0,NaN
141,GMC,Yukon XL 2500 SLT,SUV,USA,All,"$46,265","$40,534",6.0,8.0,325.0,13.0,17.0,6133.0,130.0,219.0,NaN
229,Lincoln,Navigator Luxury,SUV,USA,All,"$52,775","$46,360",5.4,8.0,300.0,13.0,18.0,5969.0,119.0,206.0,NaN
56,Cadillac,Escalade EXT,Truck,USA,All,"$52,975","$48,541",6.0,8.0,NaN,13.0,17.0,5879.0,130.0,221.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
439,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
440,NaN,group by,1) data will split,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
441,NaN,NaN,2) apply the function mean(mpg),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
442,NaN,NaN,3) combine,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [119]:
cars[cars['EngineSize']>3.5]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Unnamed: 15
7,Audi,RS 6 4dr,NaN,Europe,Front,"$84,600",NaN,4.2,8.0,NaN,15.0,22.0,4024.0,109.0,191.0,NaN
8,Audi,A8 L Quattro 4dr,NaN,Europe,All,"$69,190",NaN,4.2,8.0,NaN,17.0,24.0,4399.0,121.0,204.0,NaN
9,Audi,A6 4.2 Quattro 4dr,NaN,Europe,All,"$49,690",NaN,4.2,8.0,NaN,17.0,24.0,4024.0,109.0,193.0,NaN
10,Audi,S4 Avant Quattro,NaN,Europe,All,"$49,090",NaN,4.2,8.0,NaN,15.0,21.0,3936.0,104.0,179.0,5869689.0
11,Audi,S4 Quattro 4dr,NaN,Europe,All,"$48,040",NaN,4.2,8.0,NaN,14.0,20.0,3825.0,104.0,179.0,1790.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
378,Toyota,4Runner SR5 V6,SUV,Asia,Front,"$27,710","$24,801",4.0,6.0,245.0,18.0,21.0,4035.0,110.0,189.0,NaN
401,Volkswagen,Phaeton W12 4dr,Sedan,Europe,Front,"$75,000","$69,130",6.0,12.0,420.0,12.0,19.0,5399.0,118.0,204.0,NaN
402,Volkswagen,Phaeton 4dr,Sedan,Europe,Front,"$65,000","$59,912",4.2,8.0,335.0,16.0,22.0,5194.0,118.0,204.0,NaN
403,Volkswagen,Passat W8,Wagon,Europe,Front,"$40,235","$36,956",4.0,8.0,270.0,18.0,25.0,4067.0,106.0,184.0,NaN
404,Volkswagen,Passat W8 4MOTION 4dr,Sedan,Europe,Front,"$39,235","$36,052",4.0,8.0,270.0,18.0,25.0,3953.0,106.0,185.0,NaN

In [127]:
cars[(cars['EngineSize']<4) | (cars['Weight']>3500)]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length,Unnamed: 15
0,Acura,NSX coupe 2dr manual S,Sports,Asia,Rear,"$89,765","$79,978",3.2,6.0,290.0,17.0,24.0,3153.0,100.0,174.0,NaN
1,Acura,3.5 RL w/Navigation 4dr,Sedan,Asia,Front,"$46,100","$41,100",3.5,6.0,225.0,18.0,24.0,3893.0,115.0,197.0,NaN
2,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225.0,18.0,24.0,3880.0,115.0,197.0,NaN
3,Acura,MDX,NaN,Asia,All,"$36,945",NaN,3.5,6.0,265.0,17.0,23.0,4451.0,106.0,189.0,NaN
4,Acura,TL 4dr,NaN,Asia,Front,"$33,195",NaN,3.2,6.0,270.0,20.0,28.0,3575.0,108.0,186.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
423,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208.0,20.0,27.0,3823.0,109.0,186.0,NaN
424,Volvo,S60 T5 4dr,Sedan,Europe,Front,"$34,845","$32,902",2.3,5.0,247.0,20.0,28.0,3766.0,107.0,180.0,NaN
425,Volvo,S60 2.5 4dr,Sedan,Europe,All,"$31,745","$29,916",2.5,5.0,208.0,20.0,27.0,3903.0,107.0,180.0,NaN
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170.0,22.0,29.0,2822.0,101.0,180.0,NaN
427,Volvo,S40 4dr,Sedan,Europe,Front,"$25,135","$23,701",1.9,4.0,170.0,22.0,29.0,2767.0,101.0,178.0,NaN

In [126]:
cars['EngineSize']<4

0       True
1       True
2       True
3       True
4       True
       ...
438    False
439    False
440    False
441    False
442    False
Name: EngineSize, Length: 443, dtype: bool

## Crosstab

In [128]:
pd.crosstab(index=cars['Type'],columns=cars['Weight'])

Weight,1850.0,2035.0,2055.0,2085.0,2195.0,2255.0,2290.0,2339.0,2340.0,2348.0,...,5423.0,5440.0,5464.0,5590.0,5678.0,5879.0,5969.0,6133.0,6400.0,7190.0
Type,,,,,,,,,,,,,,,,,,,,,
Hybrid,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
SUV,0,0,0,0,0,0,0,0,0,0,...,1,0,0,1,0,0,1,1,1,1
Sedan,0,1,1,1,0,1,1,1,1,1,...,0,0,0,0,0,0,0,0,0,0
Sports,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Truck,0,0,0,0,0,0,0,0,0,0,...,0,1,1,0,1,1,0,0,0,0
Wagon,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [132]:
c=pd.crosstab(index=cars['Model'],columns=cars['Weight'])
c.head()

Weight,1850.0,2035.0,2055.0,2085.0,2195.0,2255.0,2290.0,2339.0,2340.0,2348.0,...,5423.0,5440.0,5464.0,5590.0,5678.0,5879.0,5969.0,6133.0,6400.0,7190.0
Model,,,,,,,,,,,,,,,,,,,,,
3.5 RL 4dr,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3.5 RL w/Navigation 4dr,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
300M 4dr,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
300M Special Edition 4dr,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
325Ci 2dr,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

## Groupby

In [141]:
list(cars.groupby(["Type",'Cylinders'])['Weight'])

[(('Hybrid', 3.0),
  159    1850.0
  Name: Weight, dtype: float64),
 (('Hybrid', 4.0),
  156    2732.0
  388    2890.0
  Name: Weight, dtype: float64),
 (('SUV', 4.0),
  157    3258.0
  161    3468.0
  203    3826.0
  244    3091.0
  294    3240.0
  346    3381.0
  389    3119.0
  Name: Weight, dtype: float64),
 (('SUV', 6.0),
  39     4023.0
  47     4600.0
  52     4024.0
  70     4425.0
  80     2866.0
  123    4463.0
  128    3346.0
  143    4945.0
  150    4387.0
  169    3549.0
  187    4967.0
  188    3836.0
  201    3790.0
  202    3575.0
  206    4112.0
  217    3577.0
  224    4065.0
  278    4374.0
  286    4718.0
  287    4134.0
  304    3871.0
  310    3760.0
  326    3779.0
  365    3682.0
  367    3020.0
  377    3935.0
  378    4035.0
  405    5086.0
  418    4638.0
  Name: Weight, dtype: float64),
 (('SUV', 8.0),
  30     4824.0
  57     5367.0
  60     4302.0
  66     4947.0
  67     5050.0
  107    4987.0
  120    5000.0
  141    6133.0
  142    5042.0
  166    6400.0
  215    5379.0
  216    4576.0
  218    5590.0
  222    4740.0
  229    5969.0
  233    4834.0
  255    5423.0
  264    4874.0
  300    5013.0
  334    4950.0
  373    5390.0
  374    5270.0
  Name: Weight, dtype: float64),
 (('SUV', 10.0),
  118    7190.0
  Name: Weight, dtype: float64),
 (('Sedan', 4.0),
  25     3252.0
  83     3174.0
  85     2617.0
  86     2676.0
  87     2617.0
          ...
  411    3003.0
  412    2820.0
  413    2934.0
  414    2897.0
  427    2767.0
  Name: Weight, Length: 93, dtype: float64),
 (('Sedan', 5.0),
  417    3450.0
  419    3450.0
  420    3691.0
  422    3571.0
  424    3766.0
  425    3903.0
  Name: Weight, dtype: float64),
 (('Sedan', 6.0),
  1      3893.0
  2      3880.0
  32     3472.0
  33     3616.0
  35     3428.0
          ...
  387    3417.0
  406    3721.0
  410    3179.0
  416    3653.0
  421    3576.0
  Name: Weight, Length: 111, dtype: float64),
 (('Sedan', 8.0),
  26     4464.0
  27     4376.0
  29     3814.0
  58     4044.0
  59     3992.0
  61     3984.0
  122    4057.0
  125    4057.0
  127    4057.0
  179    3977.0
  180    3851.0
  191    3948.0
  194    3803.0
  195    4046.0
  196    3803.0
  197    3874.0
  220    3990.0
  221    3715.0
  230    4474.0
  231    4369.0
  232    3768.0
  234    4369.0
  235    3768.0
  252    4085.0
  254    4390.0
  256    4160.0
  258    3815.0
  260    3585.0
  275    4195.0
  277    4052.0
  279    4052.0
  280    4052.0
  319    3790.0
  402    5194.0
  404    3953.0
  Name: Weight, dtype: float64),
 (('Sedan', 12.0),
  249    4473.0
  401    5399.0
  Name: Weight, dtype: float64),
 (('Sports', 4.0),
  149    2835.0
  241    2387.0
  242    2387.0
  266    3055.0
  288    3263.0
  354    3263.0
  359    3085.0
  383    2195.0
  385    2500.0
  Name: Weight, dtype: float64),
 (('Sports', 6.0),
  0      3153.0
  28     3781.0
  31     3415.0
  34     2998.0
  41     2932.0
  91     3060.0
  134    3290.0
  172    3023.0
  259    3220.0
  290    3296.0
  292    3241.0
  299    3428.0
  305    3188.0
  330    3131.0
  331    3240.0
  332    3135.0
  333    3119.0
  335    2911.0
  336    2811.0
  Name: Weight, dtype: float64),
 (('Sports', 8.0),
  55     3647.0
  63     3248.0
  65     3246.0
  119    3780.0
  124    3347.0
  189    4042.0
  190    3865.0
  192    3980.0
  193    3779.0
  219    3840.0
  251    4235.0
  253    4065.0
  320    3725.0
  Name: Weight, dtype: float64),
 (('Sports', 10.0),
  105    3410.0
  Name: Weight, dtype: float64),
 (('Sports', 12.0),
  250    4429.0
  Name: Weight, dtype: float64),
 (('Truck', 4.0),
  84     3623.0
  138    3028.0
  148    3351.0
  248    2960.0
  360    3485.0
  397    2750.0
  Name: Weight, dtype: float64),
 (('Truck', 6.0),
  82     4142.0
  112    3829.0
  113    4542.0
  115    3714.0
  146    4083.0
  243    3571.0
  311    3932.0
  381    4435.0
  393    3925.0
  Name: Weight, dtype: float64),
 (('Truck', 8.0),
  56     5879.0
  64     4760.0
  68     4804.0
  69     5678.0
  121    5464.0
  131    4788.0
  144    5440.0
  147    4548.0
  307    5287.0
  Name: Weight, dtype: float64),
 (('Wagon', 4.0),
  135    2702.0
  212    2447.0
  295    3020.0
  328    2701.0
  339    3620.0
  344    3109.0
  352    2425.0
  361    3430.0
  362    3090.0
  368    2932.0
  392    2679.0
  407    3338.0
  415    3034.0
  426    2822.0
  Name: Weight, dtype: float64),
 (('Wagon', 5.0),
  423    3823.0
  Name: Weight, dtype: float64),
 (('Wagon', 6.0),
  42     3594.0
  77     3458.0
  93     4675.0
  130    3497.0
  182    4056.0
  226    3410.0
  262    3966.0
  270    3470.0
  282    3488.0
  302    3801.0
  Name: Weight, dtype: float64),
 (('Wagon', 8.0),
  181    4309.0
  257    4230.0
  403    4067.0
  Name: Weight, dtype: float64)]

 ## pivot table

In [10]:
import pandas as pd
df = pd.read_excel(r'C:\Users\admin\Downloads\sample_pivot.xlsx')

In [11]:
df.head()

        Date Region                 Type  Units  Sales
0 2020-07-11   East  Children's Clothing   18.0    306
1 2020-09-23  North  Children's Clothing   14.0    448
2 2020-04-02  South     Women's Clothing   17.0    425
3 2020-02-28   East  Children's Clothing   26.0    832
4 2020-03-19   West     Women's Clothing    3.0     33

In [14]:
pivot1 = pd.pivot_table(data=df,index = 'Region')

In [15]:
pivot1

             Sales      Units
Region
East    408.182482  19.732360
North   438.924051  19.202643
South   432.956204  20.423358
West    452.029412  19.294118

In [18]:
pivot2 = pd.pivot_table(df,index='Region',values='Sales')
pivot2

             Sales
Region
East    408.182482
North   438.924051
South   432.956204
West    452.029412